{
  "syarat_dan_rukun": {
    "id": 101,
    "title": "Syarat dan Rukun Puasa",
    "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Syarat dan Rukun Puasa</h1>\n\n<p><b>Syarat Wajibnya Puasa Ramadhan</b></p>\n\n<p>Ada beberapa syarat yang mewajibkan seseorang berpuasa:</p>\n<ol>\n <li>Islam (HR. Bukhari dan Muslim)</li>\n <li>Baligh (HR. Abu Dawud dan Nasa’i)</li>\n <li>Berakal (HR. Abu Dawud dan Nasa’i)</li>\n <li>Suci dari haid dan nifas (HR. Muslim)</li>\n <li>Mampu (QS. alHajj:78)</li>\n <li>Mukim (tidak bepergian) (HR. Bukhari dan Muslim)</li>\n</ol>\n\n<p><b>Syarat Sahnya Puasa:</b></p>\n<ol>\n <li>Islam (HR. Bukhari dan Muslim)</li>\n <li>Suci dari haidl dan nifas (HR. Muslim)</li>\n <li>Tamyiz</li>\n</ol>\n\n<p><b>Rukun Puasa:</b></p>\n<ol>\n <li>Niat, dilakukan tiap malam (HR. Ahmad dan Ashhabus Sunan)</li>\n <li>Menjaga diri dari hal-hal yang membatalkan (QS. Al-Baqarah:187)</li>\n</ol>\n\n</body>\n</html>\n"
  },
  "adab_adab": {
    "id": 102,
    "title": "Adab-Adab Puasa",
    "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Adab-Adab Puasa</h1>\n\n<p>Dianjurkan bagi orang yang berpuasa untuk memperhatikan adab-adab berikut ini:</p>\n\n<p>Pertama, <b>makan sahur.</b> Dianjurkan pula untuk mengakhirkan makan sahur.</p>\n\n<p>Dari Anas <i>rodhiallohu ‘anhu</i> dari Zaid bin Tsabit <i>rodhiallohu ‘anhu</i> berkata, <i>“Kami makan sahur bersama Nabi shollallohu ‘alaihi wa sallam kemudian melaksanakan sholat.” Aku (Anas) berkata, “Berapa lama antara iqomah dan makan sahur?” Zaid bin Tsabit rodhiallohu ‘anhu berkata, “Jangka waktu untuk membaca Al Quran 50 ayat.”</i> (Muttafaqun ‘alaih)</p>\n\n<p>Jika azan terdengar sedangkan makanan dan minuman masih berada di tangan, maka boleh untuk meneruskan makan dan minum.</p>\n\n<p>Kedua, <b>menahan diri dari kata-kata sia-sia dan kotor/menjijikkan dan sejenisnya yang bertentangan dengan puasa.</b></p>\n\n<p>Ketiga, <b>dermawan dan mempelajari Al Quran.</b></p>\n\n<p>Keempat, <b>menyegerakan berbuka puasa.</b></p>\n\n<p>Kelima, <b>berbuka puasa secara sederhana</b> dengan hal-hal yang disebutkan dalam hadits berikut.</p>\n\n<p><i>“Rosululloh shollallohu ‘alaihi wa sallam berbuka dengan kurma basah sebelum sholat. Jika tidak ada kurma basah maka beliau berbuka dengan kurma kering. Jika tidak ada kurma kering maka beliau minum beberapa teguk air.”</i> (Hasan Shohih. HR. Abu Daud, Tirmidzi)</p>\n\n<p>Keenam, <b>berdoa pada saat berbuka sesuai dengan hadits berikut.</b></p>\n\n<p><i>“Apabila Rosululloh shollallohu ‘alaihi wa sallam berbuka beliau berdoa yang artinya, ‘Rasa haus telah hilang, kerongkongan telah basah, pahala telah ditetapkan, Insyaa Alloh.’”</i> (Hasan. Shohih Sunan Abu Daud)</p>\n\n</body>\n</html>\n"
  },
  "yang_dibolehkan": {
    "id": 103,
    "title": "Hal-Hal yang Diperbolehkan Ketika Berpuasa",
    "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hal-Hal yang Diperbolehkan Ketika Berpuasa</h1>\n\n<p>Pertama, <b>mandi untuk menyegarkan badan.</b></p>\n\n<p>Kedua, <b>berkumur-kumur dan memasukkan air ke dalam hidung namun tidak berlebihan.</b></p>\n\n<p>Ketiga, <b>berbekam.</b> Hukumnya berubah menjadi makruh jika khawatir dirinya menjadi lemah. Yang dihukumi sama dengan bekam adalah donor darah. Jika orang yang ingin mendonorkan darahnya merasa khawatir menjadi lemas maka tidak boleh mendonorkan darah ketika siang hari kecuali sangat dibutuhkan.</p>\n\n<p>Keempat, <b>mencium dan bercumbu dengan istri bagi yang mampu menahan dirinya.</b></p>\n\n<p>Kelima, <b>dalam keadaan junub ketika sudah terbit fajar.</b></p>\n\n<p>Keenam, <b>menyatukan sahur dan berbuka.</b></p>\n\n<p>Ketujuh, <b>menggosok gigi, memakai minyak wangi, minyak rambut, celak mata, obat tetes mata dan suntik.</b></p>\n\n<p>Dasar dibolehkannya perkara-perkara tersebut adalah kaidah baroo’ah ashliyyah (seseorang terbebas dari suatu hukum sampai ada dalil, pent) Seandainya perkara-perkara itu termasuk perkara yang diharamkan ketika berpuasa niscaya Alloh dan Rosul-Nya akan menjelaskannya.</p>\n\n<p>Alloh berfirman,</p>\n\n<p style=\"font-size:18px;text-align:right;\">وَمَا كَانَ رَبُّكَ نَسِيّاً</p>\n\n<p><i>“Dan tidaklah Robb kalian itu lupa.”</i> (QS. Maryam: 64)</p>\n\n</body>\n</html>\n"
  },
  "yang_membatalkan": {
    "id": 104,
    "title": "Hal-Hal yang Membatalkan Puasa",
    "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hal-Hal yang Membatalkan Puasa</h1>\n\n<p><b>Pertama dan Kedua, makan dan minum dengan sengaja.</b> Jika seseorang makan atau minum dalam keadaan lupa maka tidak ada qodho’ baginya dan juga tidak membayar kaffaroh/denda.</p>\n\n<p><b>Ketiga, muntah dengan sengaja.</b> Jika muntah dengan tidak sengaja maka tidak ada kewajiban qodho’ dan tidak perlu membayar kafaroh.</p>\n\n<p><b>Keempat dan Kelima, haid dan nifas</b> meskipun menjelang berbuka puasa mengingat adanya kesepakatan ulama tentang hal tersebut.</p>\n\n<p><b>Keenam, hubungan suami istri.</b> Orang yang melakukannya wajib untuk membayar kaffaroh: Memerdekakan budak jika punya, jika tidak maka berpuasa dua bulan berturut-turut, jika tidak mampu maka memberi makan 60 orang miskin. (Muttafaqun ‘alaih)</p>\n\n</body>\n</html>\n"
  },
  "sub_ramadhan": [
    {
      "id": 111,
      "title": "Hukum Puasa Ramadhan",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum Puasa Ramadhan</h1>\n\n<p>Alloh Ta’ala berfirman,</p>\n\n<p style=\"font-size:18px;text-align:right;\">يَا أَيُّهَا الَّذِينَ آمَنُواْ كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ</p>\n\n<p><i>“Hai orang-orang yang beriman, diwajibkan atas kalian berpuasa sebagaimana diwajibkan atas orang-orang sebelum kalian agar kalian bertakwa.” </i>(QS. Al Baqoroh: 183)</p>\n\n<p>Umat Islam telah bersepakat tentang wajibnya puasa Romadhon dan merupakan salah satu rukun Islam yang dapat diketahui dengan pasti merupakan bagian dari agama. Barang siapa yang mengingkari kewajiban puasa Romadhon maka dia kafir, keluar dari Islam.</p>\n\n</body>\n</html>\n"
    },
    {
      "id": 112,
      "title": "Keutamaan Puasa Ramadhan",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Ramadhan</h1>\n\n<p><i>“Orang yang berpuasa di bulan Romadhon karena iman dan mengharap pahala dari Alloh maka dosanya di masa lalu pasti diampuni.” </i>(Muttafaqun ‘alaihi)</p>\n\n<p>Alloh ‘Azza wa Jalla berfirman dalam hadits Qudsi, <i>“Setiap amal anak Adam adalah untuknya kecuali puasa. Puasa tersebut adalah untuk-Ku dan Aku yang akan membalasnya.” </i>(Muttafaqun ‘alaihi)</p>\n\n<p><i>“Sesungguhnya bau mulut orang yang berpuasa lebih harum di sisi Alloh pada hari kiamat daripada bau misk/kasturi. Dan bagi orang yang berpuasa ada dua kegembiraan, ketika berbuka mereka bergembira dengan bukanya dan ketika bertemu Alloh mereka bergembira karena puasanya.”</i> (Muttafaqun ‘alaihi)</p>\n\n<p><i>“Sesungguhnya di surga ada sebuah pintu yang disebut Ar-Royyaan. Pada hari kiamat orang-orang yang berpuasa masuk surga melalui pintu tersebut dan tidak masuk melalui pintu tersebut seorang pun kecuali mereka. Dikatakan kepada mereka, ‘Di mana orang-orang yang berpuasa?’ Maka orang-orang yang berpuasa pun berdiri dan tidak masuk melalui pintu tersebut seorang pun kecuali mereka. Jika mereka sudah masuk, pintu tersebut ditutup dan tidak ada seorang pun yang masuk melalui pintu tersebut.”</i> (Muttafaqun ‘alaihi)</p>\n\n</body>\n</html>\n"
    },
    {
      "id": 113,
      "title": "Orang yang Diwajibkan Berpuasa",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Siapa yang Diwajibkan Berpuasa?</h1>\n\n<p>Ulama bersepakat bahwa puasa diwajibkan atas orang Islam, berakal, sudah baligh, sehat dan tidak sedang bepergian. Bagi wanita harus tidak dalam keadaan haid dan nifas. <i>(Fiqh Sunnah)</i>. Jika ada orang sakit dan musafir tetap berpuasa, maka puasanya sah. Karena bolehnya berbuka bagi keduanya adalah keringanan/rukhshoh, maka jika keduanya tidak mengambil <i>rukhsokh</i>-nya maka itu juga hal yang baik.</p>\n\n<p><b>Mana yang Lebih Utama, Berbuka atau Berpuasa ?</b></p>\n\n<p>Jika orang sakit dan musafir tidak menemukan kesulitan untuk berpuasa, maka berpuasa lebih utama. Namun jika keduanya menemukan kesulitan untuk berpuasa, maka berbuka lebih utama.</p>\n\n<p>Abu Sa’id Al-Khudzri <i>rodhiallohu ‘anhu</i> berkata, “Kami dulu berperang bersama Rosululloh <i>shollallohu ‘alaihi wa sallam</i> di bulan Romadhon. Di antara kami ada yang berpuasa dan ada yang tidak berpuasa. Orang yang berpuasa tidak memarahi orang yang tidak berpuasa begitu pula sebaliknya. Kami berpendapat bahwa barang siapa yang merasa mampu kemudian berpuasa maka hal itu baik. Dan kami juga berpendapat bahwa barang siapa yang merasa lemah kemudian tidak berpuasa maka hal itu juga baik.” (Shohih. Shohih Tirmidzi)</p>\n\n<p>Adapun tentang tidak wajibnya berpuasa bagi wanita yang sedang haid dan nifas adalah karena Rosululloh <i>shollallohu ‘alaihi wa sallam</i> bersabda, <i>“Bukankah jika wanita sedang haid tidak boleh sholat dan berpuasa? Maka itulah kekurangan agamanya.”</i> (HR. Bukhori)</p>\n\n<p>Jika wanita yang sedang haid dan nifas berpuasa, maka puasanya tidak sah. Karena suci dari haid dan nifas termasuk salah satu syarat puasa sehingga wajib bagi keduanya untuk meng-qodho’ puasanya. ‘Aisyah <i>rodhiallohu ‘anha</i> berkata, <i>“Dulu kami mengalami haid di masa Rosululloh shollallohu ‘alaihi wa sallam. Maka kami diperintahkan untuk meng-qodho’ puasa dan tidak diperintahkan untuk meng-qodho’ sholat.”</i> (Shohih. Shohih Tirmidzi)</p>\n\n<p><b>Kewajiban Bagi Laki-Laki dan Wanita yang Sudah Tua Serta Orang Sakit yang Tidak Dapat Diharapkan Lagi Kesembuhannya</b></p>\n\n<p>Bagi yang tidak mampu berpuasa karena sudah tua atau sejenisnya maka boleh untuk berbuka dengan memberi makan bagi orang miskin setiap hari yang dia tidak berpuasa karena firman Alloh Ta’ala,</p>\n\n<p style=\"font-size:18px;text-align:right;\">وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ</p>\n\n<p><i>“Dan wajib bagi orang-orang yang berat menjalankannya (jika mereka tidak berpuasa) membayar fidyah, (yaitu) memberi makan seorang miskin.”</i> (QS. Al Baqoroh: 184)</p>\n\n<p><b>Wanita Hamil dan Menyusui</b></p>\n\n<p>Jika wanita hamil dan menyusui tidak mampu berpuasa atau khawatir terhadap anaknya jika berpuasa, maka boleh bagi keduanya untuk berbuka. Dan wajib bagi keduanya untuk membayar fidyah namun tidak ada kewajiban qodho’ bagi keduanya.</p>\n\n<p><b>Ukuran Makanan yang Wajib Diberikan</b></p>\n\n<p>Dari Anas bin Malik <i>rodhiallohu ‘anhu, “Sesungguhnya dia tidak mampu untuk berpuasa Ramadhan pada suatu tahun. Kemudian dia membuat roti dalam satu piring besar dan memanggil 30 orang miskin dan membuat mereka semua kenyang.”</i> (Sanadnya Shohih. Al Irwa’)</p>\n\n</body>\n</html>\n"
    },
    {
      "id": 114,
      "title": "Niat Puasa Ramadhan",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Ramadhan</h1>\n\n<p>Dalam madzhab Syafi’i, lafadz niat puasa Ramadhan adalah sebagai berikut:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ غَدٍ عَنْ أَدَاءِ فَرْضِ الشَّهْرِ رَمَضَانَ هَذِهِ السَّنَةِ لِلَّهِ تَعَالَى</p>\n\n<p><i>Nawaitu shouma ghodin ‘an adaa-i fardhisy syahri romadhoona hadzihis sanati lillaahi ta’aala</i></p>\n\n<p>Artinya: “Aku niat puasa pada hari esok untuk melaksanakan kewajiban bulan Ramadhan tahun ini karena Allah Ta’ala”</p>\n\n<p>Sedangkan menurut Madzhab Hanbali (Hanabilah), siapa yang hatinya terbersit keinginan bahwa besok akan puasa, maka itu sudah dianggap niat.</p>\n\n</body>\n</html>\n"
    },
    {
      "id": 115,
      "title": "Doa Buka Puasa",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Doa Buka Puasa</h1>\n\n<p>Ada beberapa doa buka puasa yang bisa kita dapatkan dalam kitab-kitab hadits. Antara lain sebagai berikut:</p>\n\n<p><b>Doa Buka Puasa 1</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ</p>\n\n<p><i>(Dzahabadh dhoma-u wabtalatil uruq wa tsabatal ajru insyaa-aLlah)</i></p>\n\n<p>Artinya: “Telah hilang rasa haus dan urat-urat telah basah serta pahala akan tetap insya Allah”</p>\n\n<p>Para ulama menilai doa yang diriwayatkan Abu Dawud dan Daruquthni ini paling baik derajat haditsnya sehingga banyak ulama menyimpulkan bahwa doa inilah yang paling utama dibaca sebagai doa buka puasa.</p>\n\n<p><b>Doa Buka Puasa 2</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ</p>\n\n<p><i>(Allohumma laka shumtu wa ‘alaa rizqika afthortu)</i></p>\n\n<p>Artinya: “Ya Allah, untuk-Mu aku berpuasa dan dengan rezeki-Mu aku berbuka”</p>\n\n<p>Doa ini diriwayatkan oleh Abu Dawud. Dinilai hasan oleh Syaikh Nasiruddin Al-Albani dalam Misykatul Mashabih, namun didhaifkannya dalam Shahih wa Dhaif Al Jami’u Ash Shaghir dan kitab-kitab lainnya.</p>\n\n<p>Selain dua doa di atas, juga kami cantumkan doa buka puasa yang juga populer di masyarakat. Doa ini juga lebih panjang.</p>\n\n<p><b>Doa Buka Puasa 3</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">اللَّهُمَّ إِنِّيْ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ وَعَلَيْكَ تَوَكَّلْتُ وَ بِكَ آمَنْتُ ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ تَعَالَى يَا وَاسِعَ الْفَضْلِ اغْفِرْلِىيْ اَلْحَمْدُ لِلَّهِ الَّذِي أَعَانَنِيْ فَصُمْتُ وَرَزَقَنِيْ فَأَفْطَرْتُ</p>\n\n<p><i>(Allohumma innii laka shumtu wa ‘alaa rizqika afthortu wa ‘alaika tawakkaltu wa bika aamantu, dzahabadh dhoma-u wabtalatil uruq wa tsabatal ajru insyaa-aLlahu ta’ala. Yaa waa si-al fadhli ighfirlii, alhamdulillaahil ladzii a’aananii fashumtu wa rozaqonii fa-afthortu)</i></p>\n\n<p>“Ya Allah, sesungguhnya aku berpuasa karena-Mu dan aku berbuka dengan rezeki-Mu. Kepada-Mu aku bertawakal dan kepada-Mu aku beriman. Dahaga telah lenyap, urat-urat telah basah dan pahala telah pasti didapatkan, insya Allah. Wahai Tuhan yang luas karunia-Nya, ampunilah dosaku. Segala puji bagi Allah yang telah membantuku sehingga ku dapat berpuasa dan memberiku rezeki sehingga aku dapat berbuka.”</p>\n\n<p>Doa ini dicantumkan Prof. Dr. Wahbah Az Zuhaili dalam Fiqih Islam wa Adillatuhu. Beliau menyebutnya sebagai doa buka puasa yang ma’tsur.</p>\n\n<p>Kapan waktu terbaik membaca doa buka puasa di atas? Jika doa-doa lainnya biasa dibaca sebelum memulai sesuatu, seperti doa makan dan doa naik kendaraan, doa buka puasa di atas dibaca setelah berbuka (bisa setelah makan kurma atau minum air). Ada pun sebelum berbuka, membaca basmalah.</p>\n\n<p>Lalu, anjuran memperbanyak doa saat berbuka itu kapan waktunya? Maksudnya adalah memperbanyak doa menjelang berbuka. Jadi, menjelang tiba waktu berbuka, perbanyaklah berdoa. Doa apa saja baik untuk kebaikan dunia maupun untuk kebaikan akhirat. Untuk kebaikan akhirat ini jangan sampai dilupakan.</p>\n\n</body>\n</html>\n"
    },
    {
      "id": 116,
      "title": "Doa Sahur",
      "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Doa Sahur</h1>\n\n<p>Dalam kitab-kitab hadits, tidak ada doa khusus ketika makan sahur. Demikian pula dalam kitab-kitab fiqih terkemuka (Fiqih Sunnah, Fiqih Islam wa Adillatuhu, Fiqih Empat Madzhab), hanya dicantumkan doa buka puasa namun tidak dicantumkan doa sahur.</p>\n\n<p>Dengan demikian, doa sebelum makan sahur sama dengan doa sebelum makan. Yakni membaca:</p>\n\n<p style=\"font-size:18px;text-align:right;\">بِسْمِ اللَّهِ</p>\n\n<p><i>Bismillah</i>\n\n<p>Artinya: “Dengan menyebut nama Allah”</p>\n\n<p>Sedangkan doa yang lebih populer namun dipersoalkan keshahihannya adalah:</p>\n\n<p style=\"font-size:18px;text-align:right;\">اَللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ</p>\n\n<p><i>Allohumma baariklanaa fiimaa rozaqtanaa wa qinaa ‘adzaaban naar</i></p>\n\n<p>Artinya: “Ya Allah, berkahilah untuk kami apa yang Engkau karuniakan kepada kami dan peliharalah kami dari adzab neraka” (HR. Imam Malik dalam Al Muwatha’)</p>\n\n<p>Sebagaimana penjelasan di atas, saat sahur ini sangat baik untuk berniat puasa. Niat puasa Ramadhan sebaiknya dilakukan saat sahur agar tidak ketinggalan (terdahului terbitnya fajar).</p>\n\n<p>Sebab menurut jumhur ulama selain madzhab Syafi’i, makan sahur sudah dianggap niat puasa Ramadhan, kecuali saat makan sahur berniat tidak puasa. Sedangkan menurut madzhab Syafi’i, makan sahur tidak dianggap niat puasa Ramadhan kecuali jika makan sahurnya disertai niat puasa Ramadhan.</p>\n\n</body>\n</html>\n"
    }
  ],
  "sub_sunnah": [
    {
      "id": 121,
      "title": "Puasa Arafah",
      "hukum_puasa_arafah": [
        {
          "id": 111,
          "title": "Hukum Puasa Arafah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum Puasa Arafah</h1>\n\n<p>Bagi kaum muslimin yang tidak sedang mengerjakan ibadah haji, puasa arafah hukumnya sunnah muakkadah. Sedangkan bagi kaum muslimin yang sedang berhaji, tidak ada keutamaan untuk puasa pada hari arafah.</p>\n\n<p style=\"font-size:18px;text-align:right;\">عَنْ عِكْرِمَةَ قَالَ دَخَلْتُ عَلَى أَبِى هُرَيْرَةَ فِى بَيْتِهِ فَسَأَلْتُهُ عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَاتٍ فَقَالَ أَبُو هُرَيْرَةَ نَهَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَاتٍ</p>\n\n<p>Dari Ikrimah, ia mengatakan: <i>“aku masuk ke rumah Abu Hurairah lalu bertanya tentang puasa hari Arafah bagi (jamaah haji yang sedang) di Arafah.” Lalu Abu Hurairah menjawab, “Rasulullah shallallahu ‘alaihi wasallam melarang puasa hari Arafah di Arafah”</i> (HR. Ibnu Majah dan Ahmad)</p>\n\n<p>Sayyid Sabiq dalam Fiqih Sunnah mencantumkan hadits tersebut kemudian mengutip penjelasan Imam Tirmidzi. “Para ulama memandang sunnah berpuasa pada hari arafah kecuali apabila berada di Arafah,” kata penyusun Sunan Tirmidzi itu.</p>\n\n<p>Prof. Dr. Wahbah Az Zuhaili dalam Fiqih Islam wa Adilatuhu menjelaskan, “bagi orang yang sedang menunaikan haji, tidak disunnahkan berpuasa hari Arafah. Bahkan disunnahkan untuk tidak berpuasa meskipun ia kuat agar tersedia kekuatan untuk berdoa dan juga mengikuti sunnah.”</p>\n\n<p>“Sedangkan menurut mazhab Hanafi,” lanjut Syaikh Wahbah, “orang yang sedang berhaji boleh berpuasa hari arafah jika ia kuat.”</p>\n\n<p>Syaikh Musthofa Al Bugho dalam Nuzhatul Muttaqin menjelaskan, “Pada hari Arafah, orang-orang yang tidak melakukan haji disunnahkan melakukan puasa Arafah, sedangkan orang-orang yang sedang melakukan haji tidak disunnahkan puasa karena dapat menyebabkan badannya lemah sehingga amalan-amalan ibadah yang lain terganggu.”</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Waktu Puasa Arafah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Waktu Puasa Arafah</h1>\n\n<p>Puasa arafah disunnahkan bagi kaum muslimin yang tidak sedang mengerjakan ibadah haji. Waktunya bertepatan dengan waktu wukuf. Jadi, saat jamaah haji sedang wukuf di arafah pada tanggal 9 Dzulhijjah, kaum muslimin yang tidak sedang mengerjakan haji disunnahkan untuk puasa arafah.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Keutamaan Puasa Arafah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Arafah</h1>\n\n<p>Keutamaan puasa sunnah ini sangat luar biasa sehingga sangat merugi jika ditinggalkan atau terlewatkan.</p>\n\n<p>Berikut ini tujuh hadits shahih yang menjelaskan keutamaannya.</p>\n\n<p style=\"font-size:18px;text-align:right;\">وَسُئِلَ عَنْ صَوْمِ يَوْمِ عَرَفَةَ فَقَالَ يُكَفِّرُ السَّنَةَ الْمَاضِيَةَ وَالْبَاقِيَةَ</p>\n\n<p>Rasulullah ditanya tentang puasa hari Arafah, beliau bersabda: “Menghapuskan dosa satu tahun yang lalu dan satu tahun yang akan datang.” (HR. Muslim)</p>\n\n<p style=\"font-size:18px;text-align:right;\">صِيَامُ يَوْمِ عَرَفَةَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِى قَبْلَهُ وَالسَّنَةَ الَّتِى بَعْدَهُ</p>\n\n<p>Puasa hari Arafah, aku berharap kepada Allah Dia menghapuskan dosa satu tahun sebelumnya dan satu tahun sesudahnya (HR. Muslim)</p>\n\n<p style=\"font-size:18px;text-align:right;\">صِيَامُ يَوْمِ عَرَفَةَ إِنِّى أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِى قَبْلَهُ وَالسَّنَةَ الَّتِى بَعْدَهُ</p>\n\n<p>Puasa hari Arafah, sesungguhnya aku berharap kepada Allah, Dia menghapuskan dosa satu tahun sebelumnya dan satu tahun sesudahnya (HR. Tirmidzi dan Ibnu Majah; shahih)</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ يَوْمَ عَرَفَةَ غُفِرَ لَهُ سَنَةٌ أَمَامَهُ وَسَنَةٌ بَعْدَهُ</p>\n\n<p>Barangsiapa berpuasa pada hari Arafah, maka ia diampuni dosa-dosanya setahun yang di depannya dan setahun setelahnya (HR. Ibnu Majah; shahih)</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ يَوْمَ عَرَفَةَ غُفِرَ لَهُ ذَنْبُ سَنَتَيْنِ مُتَتابِعَتَيْنِ</p>\n\n<p>Barangsiapa berpuasa pada hari Arafah, maka dosanya diampuni selama dua tahun berurut-turut. (HR. Abu Ya’la; shahih)</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ يَوْمَ عَرَفَةَ غُفِرَ لَهُ سَنَةٌ أَمَامَهُ وَسَنَةٌ خَلْفَهُ</p>\n\n<p>Barangsiapa berpuasa pada hari Arafah, maka ia diampuni tahun depannya dan tahun belakangnya. (HR. Thabrani dalam Al Mu’jam Al Ausath; shahih lighairihi)</p>\n\n<p style=\"font-size:18px;text-align:right;\">سَأَلَ رَجُلٌ عَبْدَ اللَّهِ بن عُمَرَ عَنْ صَوْمِ يَوْمِ عَرَفَةَ ؟ فَقَالَ : كُنَّا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعْدِلُهُ بِصَوْمِ سَنَتَيْنِ</p>\n\n<p>Seorang laki-laki bertanya kepada Ibnu Umar tentang puasa hari Arafah, dia menjawab, “Kami dulu bersama Rasulullah shallallahu ‘alaihi wasallam menyamakannya dengan puasa dua tahun.” (HR. Thabrani dalam Al Mu’jam Al Ausath; hasan lighairihi)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Niat Puasa Arafah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Dzulhijjah</h1>\n\n<p><b>Niat Puasa Sunah Tanggal 1 – 7 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ شَهْرِ ذِي الْحِجَّةِ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMA SYAHRI DHILHIJJATI SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya : Aku niat puasa sunnah di bulan Dzulhijjah karena Allah Ta’ala</p>\n\n<p><b>Niat Puasa Tarwiyah Tanggal 8 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ التَّرْوِيَةَ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMAT TARWIYATA SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya: Aku niat puasa sunnah tarwiyah karena Allah Ta’ala</p>\n\n<p><b>Niat Puasa Arafah Tanggal 9 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ عَرَفَةَ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMA ‘AROFATA SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya: Aku niat puasa sunnah tarwiyah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 122,
      "title": "Puasa Senin Kamis",
      "hukum_puasa_senin_kamis": [
        {
          "id": 111,
          "title": "Hukum Puasa Senin Kamis",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum Puasa Senin Kamis</h1>\n\n<p>Puasa Senin Kamis hukumnya <b>sunnah.</b> Dalam Fikih Manhaji ditegaskan, dalil sunnahnya puasa Senin Kamis adalah berdasarkan hadits yang diriwayatkan oleh Aisyah radhiyallahu ‘anha, ia berkata:</p>\n\n<p style=\"font-size:18px;text-align:right;\">كَانَ النَّبِىُّ -صلى الله عليه وسلم- يَتَحَرَّى صَوْمَ الاِثْنَيْنِ وَالْخَمِيسِ</p>\n\n<p>Nabi shallallahu ‘alaihi wasallam selalu menjaga Puasa Senin Kamis (HR. Tirmidzi dan Ahmad; shahih lighairihi)</p>\n\n<p>Syaikh Wahbah Az Zuhaili dalam Fiqih Islam wa Adillatuhu memasukkan puasa Senin Kamis dalam puasa sunah yang disepakati para ulama.</p>\n\n<p>“Puasa-puasa sunnah yang disepakati para ulama antara lain,” kata Syaikh Wahbah Az Zuhaili. “Puasa hari Senin dan Kamis setiap pekan berdasarkan perkataan Usamah bin Zaid: Nabi shallallahu ‘alaihi wasallam biasa puasa pada hari Senin dan Kamis. Suatu ketika beliau ditanya tentang hal itu lalu beliau bersabda: ‘Sesungguhnya amal-amal manusia dibeberkan (kepada Allah) pada hari Senin dan Kamis.”</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Keutamaan Puasa Senin Kamis",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Senin Kamis</h1>\n\n<p>Puasa Senin Kamis memiliki sejumlah keutamaan yang semestinya membuat kita lebih bersemangat untuk mengamalkannya. Berikut ini keutamaannya:</p>\n\n<p><b>1. Rasulullah selalu mengerjakannya</b></p>\n\n<p>Sebagaimana dua hadits dari Aisyah radhiyallahu ‘anha dan Usamah bin Zaid radhiyallahu ‘anhu di atas, Rasulullah senantiasa mengerjakan puasa ini. Beliau senantiasa menjaganya.</p>\n\n<p>Dari Aisyah radhiyallahu ‘anha beliau berkata, Nabi shallallahu ‘alaihi wasallam selalu menjaga Puasa Senin Kamis (HR. Tirmidzi dan Ahmad; shahih lighairihi)</p>\n\n<p><b>2. Hari Senin adalah hari istimewa</b></p>\n<p>Salah satu keutamaan puasa pada hari Senin adalah karena hari itu istimewa. Pada hari Senin Rasulullah dilahirkan dan pada hari Senin pula Rasulullah mendapatkan wahyu.</p>\n\n<p style=\"font-size:18px;text-align:right;\">وَسُئِلَ عَنْ صَوْمِ يَوْمِ الاِثْنَيْنِ قَالَ ذَاكَ يَوْمٌ وُلِدْتُ فِيهِ وَيَوْمٌ بُعِثْتُ أَوْ أُنْزِلَ عَلَىَّ فِيهِ</p>\n\n<p>Nabi ditanya tentang puasa pada hari Senin, maka beliau bersabda, “Itu adalah hari kelahiranku dan pada hari itu wahyu diturunkan kepadaku.” (HR. Muslim)</p>\n\n<p><b>3. Amal diperlihatkan pada Senin dan Kamis</b></p>\n<p>Pada hari Senin dan Kamis, amal-amal diperlihatkan/dilaporkan kepada Allah Subhanahu wa Ta’ala. Maka betapa beruntungnya ketika saat itu seorang hamba sedang berpuasa.</p>\n\n<p style=\"font-size:18px;text-align:right;\">تُعْرَضُ الأَعْمَالُ يَوْمَ الاِثْنَيْنِ وَالْخَمِيسِ فَأُحِبُّ أَنْ يُعْرَضَ عَمَلِى وَأَنَا صَائِمٌ</p>\n\n<p>“Diperlihatkan amal-amal pada setiap hari Kamis dan Senin. Maka aku ingin amalku diperlihatkan saat aku berpuasa.” (HR. Tirmidzi; shahih lighairihi)</p>\n\n<p>Diperlihatkan amal-amal pada setiap hari Kamis dan Senin. Maka Allah Azza wa Jalla pada hari itu mengampuni setiap orang yang tidak menyekutukan Allah dengan sesuatu pun, kecuali orang yang bermusuhan dengan saudaranya. Maka dikatakan, “Biarkan keduanya hingga berdamai, biarkan keduanya hingga berdamai.” (HR. Muslim)</p>\n\n<p>Abu Hurairah berkata, Nabi shallallahu ‘alaihi wasallam lebih sering pada hari Senin dan Kamis. Lalu ada sahabat yang bertanya tentang hal itu. Maka Rasulullah menjawab, “Sesungguhnya seluruh amal akan dipersembahkan pada setiap hari Senin dan hari Kamis. Lalu Allah mengampuni setiap muslim atau setiap orang mukmin kecuali orang yang bermusuhan. Sebab Allah berfirman, ‘Tangguhkanlah amal kedua orang itu.’” (HR. Ahmad; shahih)</p>\n\n<p>Dari Usamah bin Zaid, ia berkata, aku bertanya, “ Ya Rasulullah, sesungguhnya engkau berpuasa sampai hampir saja tidak berbuka dan engkau berbuka sampai hampir saja tidak berpuasa kecuali pada dua hari. Jika keduanya masuk dalam puasamu dan jika tidak begitu, engkau berpuasa pada keduanya.” Beliau bertanya, “Apakah nama dua hari itu?” Aku menjawab, “Hari Senin dan Kamis.” Beliau bersabda, “Itulah dua hari yang diperlihatkan amal padanya kepada Rabb semesta alam. Maka aku ingin diperlihatkan amalku saat sedang berpuasa.” (HR. An Nasa’i; hasan)</p>\n\n<p><b>4. Pintu surga dibuka</b></p>\n<p>Pada hari Senin dan Kamis pula, pintu surga dibuka. Ini menunjukkan betapa mulianya hari itu dan betapa beruntungnya orang-orang yang berpuasa.</p>\n\n<p style=\"font-size:18px;text-align:right;\">تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ رَجُلاً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ</p>\n\n<p>“Pintu-pintu surga dibuka pada hari Senin dan Kamis. Maka semua hamba yang tidak menyekutukan Allah dengan sesuatu diampuni kecuali seseorang yang antara dirinya dengan saudaranya terdapat permusuhan.” (HR. Muslim)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Tata Cara Puasa Senin Kamis",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tata Cara Puasa Senin Kamis</h1>\n\n<p>Tata cara puasa Senin Kamis tidak berbeda dengan puasa pada umumnya, baik puasa Ramadhan maupun puasa sunnah lainnya. Yakni sebagai berikut:</p>\n\n<p><b>1. Niat</b></p>\n<p>Niat puasa Senin Kamis sebaiknya dilakukan di malam hari, sebelum terbit fajar. Namun karena ini adalah puasa sunnah, maka jika terlupa, boleh niat di pagi hari asalkan belum makan apa-apa dan tidak melakukan hal apapun yang membatalkan puasa.</p>\n\n<p><b>2. Makan Sahur</b></p>\n<p>Makan sahur merupakan salah satu sunnah puasa yang jika dilakukan akan mendapat pahala dan keberkahan. Namun jika tidak dilakukan, misalnya karena bangunnya terlambat, puasanya tetap sah.</p>\n\n<p><b>3. Menahan diri dari hal-hal yang membatalkan</b></p>\n<p>Yakni menahan diri dari makan, minum, berhubungan dengan istri dan hal-hal lainnya yang dapat membatalkan puasa. Waktunya dimulai sejak terbit fajar hingga terbenamnya matahari.</p>\n\n<p><b>4. Berbuka</b></p>\n<p>Buka puasa waktunya ketika matahari terbenam, yakni saat masuknya waktu sholat Maghrib. Menyegerakan buka puasa merupakan salah satu sunnah puasa.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Niat Puasa Senin Kamis",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tata Cara Puasa Senin Kamis</h1>\n\n<p>Tata cara puasa Senin Kamis tidak berbeda dengan puasa pada umumnya, baik puasa Ramadhan maupun puasa sunnah lainnya. Yakni sebagai berikut:</p>\n\n<p><b>1. Niat</b></p>\n<p>Niat puasa Senin Kamis sebaiknya dilakukan di malam hari, sebelum terbit fajar. Namun karena ini adalah puasa sunnah, maka jika terlupa, boleh niat di pagi hari asalkan belum makan apa-apa dan tidak melakukan hal apapun yang membatalkan puasa.</p>\n\n<p><b>2. Makan Sahur</b></p>\n<p>Makan sahur merupakan salah satu sunnah puasa yang jika dilakukan akan mendapat pahala dan keberkahan. Namun jika tidak dilakukan, misalnya karena bangunnya terlambat, puasanya tetap sah.</p>\n\n<p><b>3. Menahan diri dari hal-hal yang membatalkan</b></p>\n<p>Yakni menahan diri dari makan, minum, berhubungan dengan istri dan hal-hal lainnya yang dapat membatalkan puasa. Waktunya dimulai sejak terbit fajar hingga terbenamnya matahari.</p>\n\n<p><b>4. Berbuka</b></p>\n<p>Buka puasa waktunya ketika matahari terbenam, yakni saat masuknya waktu sholat Maghrib. Menyegerakan buka puasa merupakan salah satu sunnah puasa.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 115,
          "title": "Keajaiban Puasa Senin Kamis",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Senin Kamis</h1>\n\n<p>Di dalam hadits, tidak ditemukan bagaimana lafadz niat puasa Senin Kamis. Rasulullah shallallahu ‘alaihi wasallam dan para sahabat beliau biasa mengerjakan amal dengan niat tanpa dilafalkan.</p>\n\n<p>Dalam Fiqih Islam wa Adilatuhu dijelaskan, semua ulama sepakat bahwa tempat niat adalah hati. Melafalkan niat bukanlah syarat, namun jumhur ulama berpendapat hukumnya sunnah dengan maksud membantu hati dalam menghadirkan niat. Sedangkan menurut mazhab Maliki, yang terbaik adalah tidak melafalkan niat karena tidak bersumber dari Rasulullah shallallahu ‘alaihi wasallam.</p>\n\n<p>Lafadz niat puasa Senin adalah sebagai berikut:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ يَوْمَ الْإِثْنَيْنِ سُنَّةً لِلَّهِ تَعَالَى</p>\n\n<p><i>(Nawaitu shouma yaumal itsnaini sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: saya niat puasa sunnah hari Senin, sunnah karena Allah Ta’ala</p>\n\n<p>Sedangkan lafadz niat puasa Kamis adalah sebagai berikut: </p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ يَوْمَ الْخَمِيْسِ سُنَّةً لِلَّهِ تَعَالَى</p>\n\n<p><i>(Nawaitu shouma yaumal khomiisi sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: saya niat puasa sunnah hari Kamis, sunnah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 123,
      "title": "Puasa Daud",
      "hukum_puasa_daud": [
        {
          "id": 111,
          "title": "Hukum dan Pengertian Puasa Daud",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum dan Pengertian Puasa Daud</h1>\n\n<p>Puasa Daud adalah puasa selang-seling, yakni sehari puasa sehari tidak. Disebut Puasa Daud karena puasa ini merupakan puasanya Nabi Daud ‘alaihis salam.</p>\n\n<p>Untuk umat Nabi Muhammad, puasa ini hukumnya sunnah. Dibandingkan puasa sunnah lainnya, Puasa Daud lebih disukai Allah Subhanahu wa Ta’ala. Sebagaimana sabda Rasulullah shallallahu ‘alaihi wasallam:</p>\n\n<p style=\"font-size:18px;text-align:right;\">أَحَبُّ الصِّيَامِ إِلَى اللَّهِ صِيَامُ دَاوُدَ ، كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا ، وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ ، كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ</p>\n\n<p><i>Puasa yang paling disukai oleh Allah adalah puasa Nabi Daud. Ia berpuasa satu hari lalu berbuka satu hari. Dan sholat yang paling disukai oleh Allah adalah sholat Nabi Daud. Ia tidur seperdua malam, bangun sepertiganya, lalu tidur seperenamnya.</i> (HR. Bukhari)</p>\n\n<p>Para ulama bersepakat mengenai sunnahnya puasa ini. Syaikh Wahbah Az Zuhaili dalam Fiqih Islam wa Adillatuhu menegaskan, “Puasa-puasa sunnah yang disepakati para ulama antara lain puasa sehari dan tidak puasa sehari. Inilah puasa yang paling utama.”</p>\n\n<p>Syaikh Abdurrahman Al Juzairi dalam Fikih Empat Madzhab mengatakan, “Di antara puasa yang dianjurkan adalah puasa Daud. Yakni satu hari puasa dan satu hari tidak. Di dalam hadits Nabi shallallahu ‘alaihi wasallam disebutkan bahwa puasa ini adalah puasa sunnah yang paling afhdal.”</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Keutamaan Puasa Daud",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Daud</h1>\n\n<p>Puasa Daud memiliki banyak keutamaan yang luar biasa. Berikut ini empat keutamaan Puasa Daud:</p>\n\n<p><b>1. Puasa sunnah paling utama</b></p>\n<p>Puasa Daud adalah puasa sunnah yang paling afdhal, paling utama. Sebagaimana sabda Rasulullah shallallahu ‘alaihi wasallam:</p>\n\n<p style=\"font-size:18px;text-align:right;\">أَفْضَلُ الصِّيَامِ صِيَامُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا</p>\n\n<p>Puasa yang paling utama adalah puasa Nabi Daud ‘alaihis salam. Beliau berpuasa sehari dan tidak berpuasa sehari. (HR. An Nasa’i; shahih)</p>\n\n<p><b>2. Puasa sunnah yang paling dicintai Allah</b></p>\n<p>Puasa Daud adalah puasa sunnah yang paling dicintai Allah Subhanahu wa Ta’ala. Rasulullah shallallahu ‘alaihi wasallam bersabda:</p>\n\n<p style=\"font-size:18px;text-align:right;\">إِنَّ أَحَبَّ الصِّيَامِ إِلَى اللَّهِ صِيَامُ دَاوُدَ وَأَحَبَّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ وَكَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا</p>\n\n<p>“Puasa yang paling dicintai oleh Allah adalah puasa Nabi Daud. Dan sholat yang paling dicintai oleh Allah adalah sholat Nabi Daud. Ia tidur seperdua malam, bangun sepertiganya, lalu tidur seperenamnya. Dan ia berpuasa satu hari lalu berbuka satu hari. (HR. Muslim)</p>\n\n<p><b>3. Puasa sunnah tertinggi</b></p>\n<p>Puasa Daud merupakan puasa terbaik sekaligus puasa tertinggi dan terberat. Tidak boleh berpuasa melebihi ini karena tubuh juga punya hak untuk dijaga. Sebagaimana diriwayatkan oleh Imam Ahmad dan lainnya:</p>\n\n<p>Abdullah bin Amr berkata, Rasulullah shallallahu ‘alaihi wasallam menanyakan kepadaku, “Aku mendengar kabar bahwa engkau selalu qiyamul lail dan siangnya berpuasa.” Aku menjawab, “Benar ya Rasulullah.”</p>\n\n<p>Maka Rasulullah bersabda, “Berpuasalah dan berbukalah. Shalatlah dan tidurlah! Karena tubuhmu memiliki hak terhadapmu. Istrimu memiliki hak terhadapmu. Dan tamumu juga memiliki hak terhadapmu. Cukuplah bagimu berpuasa tiga hari setiap bulan.”</p>\n\n<p>Abdullah berkata, aku bertahan, maka Rasulullah pun bersikeras pula. Akhirnya aku berkata, “Ya Rasulullah, aku sanggup lebih dari itu.”</p>\n\n<p>Rasulullah bersabda, “Kalau begitu, berpuasalah tiga hari setiap pekan.”</p>\n\n<p>Abdullah berkata, aku bertahan, maka Rasulullah pun bersikeras pula. Aku berkata lagi, “Ya Rasulullah, aku sanggup lebih dari itu.”</p>\n\n<p>Rasulullah bersabda, “Kalau begitu, berpuasalah seperti Nabi Daud dan jangan lebih dari itu.”</p>\n\n<p>Aku bertanya, “Ya Rasulullah, bagaimana puasa Nabi Daud itu?” Rasulullah bersabda, “Ia berpuasa sehari lalu berbuka sehari.”</p>\n\n<p><b>4. Puasa yang paling adil</b></p>\n<p>Dalam riwayat Imam Muslim, Rasulullah menganjurkan puasa Daud dan menyebutnya sebagai puasa yang paling adil.</p>\n\n<p style=\"font-size:18px;text-align:right;\">صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَذَلِكَ صِيَامُ دَاوُدَ – عَلَيْهِ السَّلاَمُ – وَهُوَ أَعْدَلُ الصِّيَامِ . قَالَ قُلْتُ فَإِنِّى أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ. قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- لاَ أَفْضَلَ مِنْ ذَلِكَ</p>\n\n<p>“Berpuasalah satu hari dan berbukalah satu hari dan itu adalah puasa yang paling adil. Itu puasanya Nabi Daud ‘alaihis salam.” Aku berkata, “Sesungguhnya aku mampu lebih baik dari itu.” Rasulullah shallallahu ‘alaihi wasallam bersabda, “Tidak ada yang lebih utama dari itu.” (HR. Muslim dan Abu Dawud)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Tata Cara Puasa Daud",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tata Cara Puasa Daud</h1>\n\n<p>Tata cara puasa Daud tidaklah berbeda dengan puasa pada umumnya, baik puasa wajib maupun puasa sunnah. Secara singkat, tata caranya adalah sebagai berikut:</p>\n\n<p><b>1. Niat</b></p>\n<p>Niat puasa Daud sebaiknya dilakukan di malam hari, sebelum fajar terbit. Namun karena ini merupakan puasa sunnah, jika terlupa, boleh niat di pagi hari asalkan belum makan apa-apa dan tidak melakukan hal apapun yang membatalkan puasa.</p>\n\n<p><b>2. Makan Sahur</b></p>\n<p>Makan sahur merupakan salah satu sunnah puasa yang jika dilakukan akan mendapat pahala dan keberkahan. Namun jika tidak dilakukan, misalnya karena terlambat bangun dan waktu sahur habis, puasanya tetap sah.</p>\n\n<p><b>3. Menahan diri dari hal-hal yang membatalkan</b></p>\n<p>Yaitu menahan diri dari makan, minum, berhubungan dengan istri dan hal-hal lainnya yang bisa membatalkan puasa. Dimulai sejak terbitnya fajar hingga terbenamnya matahari.</p>\n\n<p><b>4. Berbuka</b></p>\n<p>Waktu berbuka puasa Daud sama dengan waktu berbuka puasa pada umumnya yakni ketika matahari terbenam. Menyegerakan buka puasa merupakan salah satu sunnah puasa.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Niat Puasa Daud",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Daud</h1>\n\n<p>Di dalam hadits, tidak ditemukan bagaimana lafadz niat puasa Daud. Nabi shallallahu ‘alaihi wasallam dan para sahabat beliau biasa mengerjakan amal dengan niat tanpa dilafadzkan.</p>\n\n<p>Syaikh Wahbah dalam Fiqih Islam wa Adillatuhu menjelaskan, semua ulama sepakat bahwa tempat niat adalah hati. Melafadzkan niat bukanlah syarat, namun jumhur ulama berpendapat hukumnya sunnah agar membantu hati dalam menghadirkan niat. Sedangkan menurut mazhab Maliki, yang terbaik adalah tidak melafalkan niat karena tidak bersumber dari Rasulullah shallallahu ‘alaihi wasallam.</p>\n\n<p>Lafadz niat puasa Daud adalah sebagai berikut:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ دَاوُدَ سُنَّةً لِلَّهِ تَعَالَى</p>\n\n<p><i>(Nawaitu shouma daawuda sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: saya niat puasa Daud, sunnah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 115,
          "title": "Keajaiban Puasa Daud",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keajaiban Puasa Daud</h1>\n\n<p>Puasa Nabi Daud memiliki banyak keutamaan sebagaimana telah disebutkan di atas. Itulah keajaiban terbesar puasa ini; pahalanya berlimpah dari Allah, ia puasa yang paling dicintai Allah, paling utama dan paling adil.</p>\n\n<p>Selain itu, keajaiban puasa sunnah terbaik ini juga terasa di dunia bagi orang-orang yang mendawamkannya. Hal itu terbukti dari begitu banyaknya kisah nyata keajaiban puasa Daud.</p>\n\n<p>Salah satu keajaiban puasa Daud adalah, orang yang mengamalkannya akan dibimbing Allah dan dijauhkan dari kemaksiatan. Itu terjadi misalnya pada Pak Gopar, yang pernah diceritakan Ustadz Salim A. Fillah.</p>\n\n<p>Ia tersentuh untuk mulai mendawamkan puasa Daud setelah Kyai Kholil Bisri mengingatkannya. “Kamu jadi anak shalih seperti ini, rupanya ayahmu suka puasa Daud. Lalu anakmu nanti jadi seperti apa?”</p>\n\n<p>Kalimat yang didengarnya pada hari-hari pertama kelahiran putranya itu menjadi pemicu motivasinya untuk mengamalkan puasa seperti sang ayah. Dari sana, kebeningan spiritual tumbuh. Ia menjadi orang yang nasehat-nasehatnya terasa dalam maknanya.</p>\n\n<p>Keajaiban puasa Daud yang lain terkait dengan rezeki. Ada seorang pemuda di Gresik yang mengamalkan puasa Daud bertahun-tahun. Bertahun-tahun ia hidup apa adanya dengan motor yang cukup lama sebagai kendaraan kerjanya.</p>\n\n<p>Satu hari, sebuah perusahaan makanan terbesar yang berdomisili di kecamatan Manyar mencari rekanan penyedia tenaga kerja. Ketika berkunjung ke rumahnya, manajemen perusahaan yang bertamu itu disembelihkan ayam meskipun kondisinya cukup berat.</p>\n\n<p>Tak lama setelah pertemuan itu, manajemen perusahaan menghubunginya kembali. Menyatakan deal kerja sama untuk mensuplai sekitar 2.000 pekerja. Sebenarnya waktu itu ia baru merintis dan tidak memiliki cukup sumber daya. Tapi dengan bismillah ia terima. Segera ia buka lowongan dan ia rekrut tetangganya sebagai penyeleksi lamaran-lamaran itu.</p>\n\n<p>Singkat cerita, hidupnya berubah drastis. Kini ia menjadi salah seorang terkaya di kecamatannya.</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 124,
      "title": "Puasa Asyura dan Tasu'a",
      "hukum_puasa_tasua": [
        {
          "id": 111,
          "title": "Pengertian Puasa Asyura dan Tasu'a",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Pengertian Puasa Asyura dan Tasu'a</h1>\n\n<p><b>Puasa Tasu'a</b></p>\n\n<p>Puasa tasu’a adalah puasa sunnah yang dilakukan pada tanggal 9 Muharram. Puasa ini merupakan puasa sunnah meskipun belum pernah dilakukan oleh Rasulullah shallallahu ‘alaihi wasallam.</p>\n\n<p>Sejarah puasa tasua bermula ketika Rasulullah menjalankan puasa asyura pada tanggal 10 Muharram. Sebagian sahabat menyampaikan bahwa orang-orang Yahudi juga mengagungkan hari itu bahkan berpuasa pula di dalamnya. Rasulullah lalu bersabda akan menjalankan puasa tasu’a (yakni puasa tanggal 9 Muharram) pada tahun berikutnya.</p>\n\n<p>Namun, belum lagi datang Muharram di tahun berikutnya tersebut, Rasulullah telah wafat. Jadi, meskipun secara hadits fi’liyah Rasulullah belum pernah mengerjakannya, puasa ini hukumnya sunnah karena secara qauliyah Rasulullah mengazamkannya. Maka para sahabat pun mengerjakan puasa tasu’a sepeninggal Rasulullah, lalu diteruskan para tabi’in dan generasi sesudahnya sampai pada hari ini.</p>\n\n<p style=\"font-size:18px;text-align:right;\">حِينَ صَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَوْمَ عَاشُورَاءَ وَأَمَرَ بِصِيَامِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ – إِنْ شَاءَ اللَّهُ – صُمْنَا الْيَوْمَ التَّاسِعَ</p>\n\n<p><i>Ketika Rasulullah shallallahu ‘alaihi wasallam berpuasa pada hari Asyura dan memerintahkan orang agar berpuasa padanya, mereka berkata, “Ya Rasulullah, ia adalah suatu hari yang dibesarkan oleh orang Yahudi dan Nasrani.” Maka Rasulullah shallallahu ‘alaihi wasallam bersabda, “Jika datang tahun depan, insya Allah kita berpuasa juga pada hari kesembilan.” Ibnu Abbas berkata, “Maka belum lagi datang tahun berikutnya itu, Rasulullah SAW pun wafat.”</i> (HR. Muslim dan Abu Dawud)</p>\n\n<p><b>Puasa Asyura</b></p>\n<p>Puasa asyura (dibaca puasa asyuro) adalah puasa sunnah yang dikerjakan pada tanggal 10 Muharram. Hukumnya sunnah muakkadah, yakni sunnah yang sangat dianjurkan.</p>\n\n<p>Rasulullah senantiasa mengutamakan puasa ini, bahkan perhatian beliau lebih besar dibandingkan puasa-puasa sunnah lainnya.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Keutamaan Puasa Asyura dan Tasu'a",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Asyura</h1>\n\n<p>Puasa asyura memiliki keutamaan yang luar biasa. Tiga di antara keutamaan puasa asyura dijelaskan dalam hadits-hadits berikut ini.</p>\n\n<p><b>1. Puasa paling utama</b></p>\n<p>Puasa asyura (juga puasa tasua) merupakan puasa yang dikerjakan di bulan Muharram. Puasa di bulan Muharram merupakan puasa yang paling utama setelah puasa Ramadhan.</p>\n\n<p>Rasulullah shallallahu ‘alaihi wasallam menjelaskan keutamaan puasa Muharram dengan sabda beliau:</p>\n\n<p style=\"font-size:18px;text-align:right;\">أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلاَةِ بَعْدَ الْفَرِيضَةِ صَلاَةُ اللَّيْلِ</p>\n\n<p><i>“Puasa paling utama setelah Ramadhan adalah (puasa bulan) Muharram dan shalat yang paling utama setelah shalat fardhu adalah shalat malam”</i> (HR. Muslim)</p>\n\n<p style=\"font-size:18px;text-align:right;\">سُئِلَ أَىُّ الصَّلاَةِ أَفْضَلُ بَعْدَ الْمَكْتُوبَةِ وَأَىُّ الصِّيَامِ أَفْضَلُ بَعْدَ شَهْرِ رَمَضَانَ فَقَالَ أَفْضَلُ الصَّلاَةِ بَعْدَ الصَّلاَةِ الْمَكْتُوبَةِ الصَّلاَةُ فِى جَوْفِ اللَّيْلِ وَأَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ صِيَامُ شَهْرِ اللَّهِ الْمُحَرَّمِ</p>\n\n<p><i>Rasulullah shallallahu ‘alaihi wasallam ditanya, “Shalat manakah yang lebih utama setelah shalat fardhu dan puasa manakah yang lebih utama setelah puasa Ramadhan?” Beliau bersabda, “Shalat yang paling uatama setelah shalat fardhu adalah shalat di tengah malam dan puasa yang paling utama setelah puasa Ramadhan adalah puasa pada bulan Allah (yakni) Muharram.”</i> (HR. Muslim, Abu Dawud, dan Ahmad)</p>\n\n<p><b>2. Puasa yang diutamakan Nabi</b></p>\n<p>Puasa asyura merupakan puasa yang istimewa bagi Rasulullah dan sangat diutamakan beliau. Ibnu Abbas menerangkan, tidak ada puasa sunnah yang lebih diutamakan Rasulullah melebihi puasa asyura.</p>\n\n<p style=\"font-size:18px;text-align:right;\">عَنِ ابْنِ عَبَّاسٍ – رضى الله عنهما – قَالَ مَا رَأَيْتُ النَّبِىَّ – صلى الله عليه وسلم – يَتَحَرَّى صِيَامَ يَوْمٍ فَضَّلَهُ عَلَى غَيْرِهِ ، إِلاَّ هَذَا الْيَوْمَ يَوْمَ عَاشُورَاءَ وَهَذَا الشَّهْرَ . يَعْنِى شَهْرَ رَمَضَانَ</p>\n\n<p><i>Dari Ibnu Abbas radhiyallahu anhu ia berkata, saya tidak pernah melihat Nabi shallallahu ‘alaihi wa sallam memperhatikan puasa satu hari yang diutamakannya atas yang lainnya selain hari ini, hari asyura dan bulan Ramadhan.</i> (HR. Bukhari)</p>\n\n<p><b>3. Menghapus dosa setahun sebelumnya</b></p>\n<p>Inilah keutamaan puasa asyura yang paling populer. Puasa asyura dapat menghapus dosa setahun sebelumnya, sebagaimana sabda Rasulullah shallallahu ‘alaihi wasallam:</p>\n\n<p style=\"font-size:18px;text-align:right;\">سُئِلَ عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ يُكَفِّرُ السَّنَةَ الْمَاضِيَةَ</p>\n\n<p><i>Rasulullah ditanya tentang puasa asyura, beliau menjawab, “dapat menghapus dosa setahun sebelumnya.” </i>(HR. Muslim)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Niat Puasa Asyura",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Asyura</h1>\n\n<p>Di dalam hadits juga tidak dijumpai bagaimana lafal niat puasa asyura. Rasulullah dan para sahabat biasa mengerjakan amal dengan niat tanpa dilafalkan.</p>\n\n<p>Dalam mazhab Syafi’i, lafal niat puasa asyura sebagai berikut:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ فِيْ يَوْمِ عَاشُوْرَاء سُنَّةً لِلَّهِ تَعَالَى</p>\n\n<p><i>(Nawaitu shouma fii yaumi aasyuuroo’ sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: saya niat puasa sunnah asyura sunnah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Niat Puasa Tasu'a",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Tasu’a</h1>\n\n<p>Di dalam hadits, tidak dijumpai bagaimana lafal niat puasa tasu’a. Rasulullah dan para sahabat biasa mengerjakan amal dengan niat tanpa dilafalkan.</p>\n\n<p>Syaikh Wahbah dalam Fiqih Islam wa Adilatuhu menjelaskan, semua ulama sepakat bahwa tempat niat adalah hati. Melafalkan niat bukanlah syarat, namun ia disunnahkan oleh jumhur ulama selain mazhab Maliki dengan maksud membantu hati dalam menghadirkan niat. Sedangkan menurut mazhab Maliki, yang terbaik adalah tidak melafalkan niat karena tidak bersumber dari Rasulullah shallallahu ‘alaihi wasallam.</p>\n\n<p>Dalam mazhab Syafi’i, lafal niat puasa tasu’a sebagai berikut:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ فِيْ يَوْمِ تَاسُوْعَاء سُنَّةً لِلَّهِ تَعَالَى</p>\n\n<p><i>(Nawaitu shouma fii yaumi taasuu’aa’ sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: saya niat puasa sunnah tasu’a sunnah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 115,
          "title": "Kapan waktu niat puasa ini?",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Kapan waktu niat puasa ini?</h1>\n\n<p>Kapan waktu niat puasa tasu’a dan asyura? Sebaiknya, niatnya di waktu malam sebelum terbit fajar. Namun karena ini adalah puasa sunnah, maka jika terlupa, boleh niatnya di pagi hari sebelum masuk waktu zhuhur asalkan belum makan apa-apa dan tidak melakukan hal apapun yang membatalkan puasa.</p>\n\n<p>Sebagaimana Rasulullah pernah puasa sunnah dengan niat di waktu pagi seperti pada hadits berikut ini:</p>\n\n<p style=\"font-size:18px;text-align:right;\">عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ دَخَلَ عَلَىَّ النَّبِىُّ -صلى الله عليه وسلم- ذَاتَ يَوْمٍ فَقَالَ هَلْ عِنْدَكُمْ شَىْءٌ. فَقُلْنَا لاَ. قَالَ فَإِنِّى إِذًا صَائِمٌ. ثُمَّ أَتَانَا يَوْمًا آخَرَ فَقُلْنَا يَا رَسُولَ اللَّهِ أُهْدِىَ لَنَا حَيْسٌ. فَقَالَ أَرِينِيهِ فَلَقَدْ أَصْبَحْتُ صَائِمًا . فَأَكَلَ</p>\n\n<p><i>Dari Aisyah Ummul Mukminin, ia berkata, “Nabi shallallahu ‘alaihi wa sallam pernah menemuiku pada suatu hari lantas beliau bertanya, “Apakah kalian memiliki sesuatu untuk dimakan?” Kami pun menjawab, “Tidak ada.” Beliau pun bersabda, “Kalau begitu saya puasa.” Kemudian di hari lain beliau menemui kami, lalu kami katakan pada beliau, “Kami baru saja dihadiahkan hays (jenis makanan berisi campuran kurman, samin dan tepung).” Lantas beliau bersabda, “Berikan makanan tersebut padaku, padahal tadi pagi aku sudah berniat puasa.” Lalu beliau menyantap makanan tersebut.</i> (HR. Muslim)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 116,
          "title": "Tingkatan Puasa Asyura",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tingkatan Puasa Asyura</h1>\n\n<p>Sayyid Sabiq menerangkan bahwa puasa asyura ada beberapa tingkatan. “Para ulama menyebutkan bahwa puasa Asyura ada tiga tingkatan,” tulis beliau dalam Fiqih Sunnah. Pertama, berpuasa selama tiga hari, yaitu hari kesembilan, kesepuluh dan kesebelas. Kedua, berpuasa pada hari kesembilan dan kesepuluh. Ketiga, berpuasa pada hari kesepuluh saja.</p>\n\n<p>Syaikh Wahbah Az Zuhaili menjelaskan dalam Fiqih Islam wa Adillatuhu, jika seseorang berpuasa Asyura tanpa Tasu’a, disunnahkan baginya –menurut mazhab Syafi’i- berpuasa pula pada tanggal 11. Bahkan Imam Syafi’i sendiri dalam kitab Al Umm dan Al Imlaa’ menyatakan kesunnahan berpuasa pada tiga hari tersebut sekaligus.</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 125,
      "title": "Puasa Ayyamul Bidh",
      "hukum_puasa_ayyamul": [
        {
          "id": 111,
          "title": "Pengertian Puasa Ayyamul Bidh",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Pengertian Puasa Ayyamul Bidh</h1>\n\n<p>Puasa ayyamul bidh merupakan salah satu dari beberapa puasa yang dicontohkan oleh nabi kita Nabi Muhammad shollallahu ‘alaihi wasallam. Puasa sunnah ini dilakukan pada setiap petengahan bulan hijriyah yaitu pada tanggal 13, 14 dan 15.</p>\n\n<p>Ayamul bidh terdiri dari dua kata. Arti ayyamul adalah jamak dari al-yaum yang berarti hari, sedangkan bidh artinya putih. Ayyamul bidh berarti hari-hari putih, dimana pada tanggal tersebut yaitu 13, 14 dan 15  sedang terjadi bulan purnama yang sinarnya berwarna putih.</p>\n\n<p>Walaupun bernama puasa pada hari-hari putih, puasa ini berbeda dengan puasa mutih yang biasa dikenal di lingkungan penganut kejawen. Yang tidak makan dan minum  kecuali nasi putih dan air putih saja.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Niat Puasa Ayyamul Bidh",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Ayyamul Bidh</h1>\n\n<p>Bagi sebagian umat muslim yang ingin mengucapkan niat, berikut ini adalah niat ketika hendak melaksanakan Puasa ayyamul bidh :</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ اَيَّامَ اْلبِيْضِ سُنَّةً لِلهِ تَعَالَى</p>\n\n<p>NAWAITU SAUMA AYYAMI BIDH SUNNATAN LILLAHI TA’ALA</p>\n\n<p>“Saya berniat puasa pada hari-hari putih, sunnah karena Allah ta’ala.”</p>\n\n<p>Catatan : niat puasa ini juga boleh dilakukan setelah fajat terbit selama belum makan, minum, atau melakukan hal-hal lainya yang dapat membatalkan puasa. Dan boleh juga menggabungkan dengan niat puasa yang rutin dilakukan baik puasa senin kamis, maupun puasa daud, karena ini termasuk puasa sunnah.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Tata Cara Puasa Ayyamul Bidh",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tata Cara Puasa Ayyamul Bidh</h1>\n\n<p>Puasa ayyamul bidh merupakan batas minimal anjuran dari rasulullah untuk berpuasa di luar bulan romadhon. Meskipun kebiasaan yang sering dilakukan rasulullah adalah puasa senin kamis, beliau menganjurkan untuk setidaknya puasa paling sedikit tiga hari dalam sebulan, yaitu puasa ayyamul bidh ini.</p>\n\n<p>Puasa ini dikerjakan pada setiap tanggal 13, 14 dan 15 bulan hijriyah. Kecuali pada tanggal 13 dhulhijjah, karena pada hari tersebut adalah hari diharamkanya puasa, atau biasa disebut hari tasyriq. Dalilnya sebagai berikut :</p>\n<p>Dari Abu Dzar, Rasulullah shallallahu ‘alaihi wa sallam bersabda padanya,</p>\n\n<p style=\"font-size:18px;text-align:right;\">يَا أَبَا ذَرٍّ إِذَا صُمْتَ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ فَصُمْ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ</p>\n\n<p>“Jika engkau ingin berpuasa tiga hari setiap bulannya, maka berpuasalah pada tanggal 13, 14, dan 15 (dari bulan Hijriyah).</p>\n\n<p>Bagi seorang istri, ketika ingin melakukan puasa sunnah juga harus seijn dari suaminya. Sebagaimana hadits dari abu huroiroh :</p>\n<p>“Janganlah seorang wanita berpuasa sunnah sedang suaminya ada, kecuali dengan seizinnya.”</p>\n\n<p>Puasa ini juga boleh dilakukan ketika sedang bepergian maupun sedang tidak bepergian.</p>\n\n<p>Dari Ibnu Abbas radhiyallahu ‘anhuma, beliau berkata :</p>\n\n<p style=\"font-size:18px;text-align:right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْطِرُ أَيَّامَ الْبِيضِ فِي حَضَرٍ وَلَا سَفَرٍ</p>\n\n<p>“Rasulullah shallallahu ‘alaihi wa sallam biasa berpuasa pada ayyamul biidh ketika tidak bepergian maupun ketika bersafar.”</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Keutamaan Puasa Ayyamul Bidh",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Ayyamul Bidh</h1>\n\n<p>Puasa ayyamul bidh juga memilik banyak keutamaan sebagaimana keutamaan puasa senin kamis, diantaranya adalah :</p>\n\n<p><b>Menghidupkan Sunnah Nabi</b></p>\n<p>Ketika seseorang melakukan puasa ayyamul bidh, maka secara tidak langsung ia sudah mengikuti apa yang rasulullah ajarkan. Dan ketika sudah mengikuti Rasul, maka bisa berharap akan mendapatkan syafaatnya di hari akhir kelak.</p>\n\n<p><b>Seperti Puasa Sepanjang Tahun</b></p>\n<p>Salah satu keutamaan dari puasa ayyamul bidh ini adalah seperti puasa sepanjang tahun, sebgaimana sabda nabi muhammad shallallahu alaihi wasallam :</p>\n\n<p style=\"font-size:18px;text-align:right;\">صَوْمُ ثَلاَثَةِ أَيَّامٍ صَوْمُ الدَّهْرِ كُلِّهِ</p>\n\n<p>“Puasa pada tiga hari setiap bulannya adalah seperti puasa sepanjang tahun.”</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 115,
          "title": "Hikmah Puasa Ayyamul Bidh",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hikmah Puasa Ayyamul Bidh</h1>\n\n<p>Salah satu hikmah dari Puasa Ayyamul bidh justru datang dari psikolog amerika bernama Arnold Lieber pada tahun 70-an. Psikolog tersebut mengatakan bahwa perilaku manusia pada saat bulan purnama cenderung lebih buruk daripada biasanya. (penelitian ini masih menjadi kontoroversi kebenaranya).</p>\n\n<p>Ketika ilmu sains baru mengungkapkan kelabilan manusia pada saat bulan purnama, islam telah menganjurkankan kepada ummatnya untuk berpuasa. Terlepas dari kontroversi penelitian tersebut, kita bisa mengambil hikmah, bahwa selain kita berpuasa atas dasar mengikuti apa yang rasulullah ajarkan, ternyata ada manffat lain dari puasa Ayyamul Bidh ini.</p>\n\n<p>Rasulullah telah memberi solusi bagi kita untuk menghadapi kelabilan emosi pada waktu terjadinya bulan purnama. Beliau menganjurkan untuk berpuasa, agar hati selalu tenang, terjaga dari sifat amarah, nafsu dan segala sifat-sifat buruk lainnya yang cenderung lebih meluap daripada hari biasanya.</p>\n\n<p>Dengan kata lain, kita bisa menyimpulkan bahwa anjuran rasulullah untuk berpuasa pada tanggal tersebut bukanlah sebuah kebetulan belaka.</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 126,
      "title": "Puasa di Awal Dzulhijjah",
      "hukum_puasa_dzulhijjah": [
        {
          "id": 111,
          "title": "Keutamaan Puasa Dzulhijjah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Dzulhijjah</h1>\n\n<p>Dari Ibnu ‘Abbas, Rasulullah shallallahu ‘alaihi wa sallam bersabda,</p>\n\n<p style=\"font-size:18px;text-align:right;\">« مَا مِنْ أَيَّامٍ الْعَمَلُ الصَّالِحُ فِيهَا أَحَبُّ إِلَى اللَّهِ مِنْ هَذِهِ الأَيَّامِ ». يَعْنِى أَيَّامَ الْعَشْرِ. قَالُوا يَا رَسُولَ اللَّهِ وَلاَ الْجِهَادُ فِى سَبِيلِ اللَّهِ قَالَ « وَلاَ الْجِهَادُ فِى سَبِيلِ اللَّهِ إِلاَّ رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَىْءٍ »</p>\n\n<p><i>“Tidak ada satu amal sholeh yang lebih dicintai oleh Allah melebihi amal sholeh yang dilakukan pada hari-hari ini (yaitu 10 hari pertama bulan Dzul Hijjah).” Para sahabat bertanya: “Tidak pula jihad di jalan Allah?” Nabi shallallahu ‘alaihi wa sallam menjawab: “Tidak pula jihad di jalan Allah, kecuali orang yang berangkat jihad dengan jiwa dan hartanya namun tidak ada yang kembali satupun.”</i> (HR. Abu Daud no. 2438, At Tirmidzi no. 757, Ibnu Majah no. 1727, dan Ahmad no. 1968. Shahih). Keutamaan sepuluh hari awal Dzulhijah berlaku untuk amalan apa saja, tidak terbatas pada amalan tertentu, sehingga amalan tersebut bisa shalat, sedekah, membaca Al Qur’an, dan amalan sholih lainnya. Di antara amalan yang dianjurkan di awal Dzulhijah adalah amalan puasa.</p>\n\n<p>Dari Hunaidah bin Kholid, dari istrinya, beberapa istri Nabi <i>shallallahu ‘alaihi wa sallam</i> mengatakan,</p>\n\n<p style=\"font-size:18px;text-align:right;\">كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَصُومُ تِسْعَ ذِى الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَالْخَمِيسَ</p>\n\n<p>“Rasulullah shallallahu ‘alaihi wa sallam biasa berpuasa pada sembilan hari awal Dzulhijah, pada hari ‘Asyura’ (10 Muharram), berpuasa tiga hari setiap bulannya, …” (HR. Abu Daud no. 2437. Shahih).</p>\n\n<p>Sumber: <i>rumaysho</i></p>\n\n<p>Sementara itu, dalam hadits lain disebutkan bahwa:</p>\n\n<p><i>\"Bahwa Rasulullah SAW biasanya berpuasa 9 hari Dzulhijah, hari ‘Ashuraa’, 3 hari setiap bulan yaitu Senin pertama dan 2 Kamis terawal.”</i> (HR Abu Daud)</p>\n<p><i>“Rasulullah SAW berkata: Tiada ada hari lain yang disukai Allah SWT untuk beribadah seperti sepuluh hari ini,”</i> (HR At-Tirmidzi).</p>\n\n<p>Dalam beberapa hadis menyebutkan bahwa 10 hari atau sebagiannya pada bulan Dzulhijjah adalah hari-hari yang istimewa. Umat muslim juga disunahkan melaksanakan puasa seperti apa yang Rasulullah pernah lakukan. Rasulullah Muhammad SAW juga bersabda bahwa melaksanakan puasa di bulan Dzulhijjah pahalanya sama besar dengan orang yang meninggal di jalan Allah di medang perang atau mati Syahid. Puasa ini juga bisa melebur dosa selama setahun sebelum dan sesudah seseorang yang melaksanakannya dengan ikhlas.</p>\n\n<p>Diriwayatkan oleh Imam Muslim dari Abu Qatadah, Rasullullah SAW bersabda:</p>\n\n<p><i>\"Berpuasa pada hari Arafah karena mengharap pahala dari Allah melebur dosa-dosa setahun sebelum dan sesudahnya.\"</i> (HR. Imam Muslim)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Cara Melakukan Puasa Awal Dzulhijjah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Cara Melakukan Puasa Awal Dzulhijjah</h1>\n<ul>\n <li>Boleh dilakukan dari tanggal 1 sampai 9 Dzulhijjah, lebih utama lagi puasa Arafah (9 Dzulhijjah)</li>\n <li>Boleh dilakukan dengan memilih hari yang diinginkan, yang penting jangan tinggalkan puasa Arafah.</li>\n</ul>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Niat Puasa Dzulhijjah",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Dzulhijjah</h1>\n\n<p><b>Niat Puasa Sunah Tanggal 1 – 7 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ شَهْرِ ذِي الْحِجَّةِ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMA SYAHRI DHILHIJJATI SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya : Aku niat puasa sunnah di bulan Dzulhijjah karena Allah Ta’ala</p>\n\n<p><b>Niat Puasa Tarwiyah Tanggal 8 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ التَّرْوِيَةَ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMAT TARWIYATA SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya: Aku niat puasa sunnah tarwiyah karena Allah Ta’ala</p>\n\n<p><b>Niat Puasa Arafah Tanggal 9 Dzulhijjah</b></p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ عَرَفَةَ سُنَّةً ِللهِ تَعَالَى</p>\n\n<p>Latin : “NAWAITU SHAUMA ‘AROFATA SUNNATAN LILLAAHI TA’AALA”</p>\n\n<p>Artinya: Aku niat puasa sunnah tarwiyah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 127,
      "title": "Puasa di Bulan Sya'ban",
      "hukum_puasa_dzulhijjah": [
        {
          "id": 111,
          "title": "Hukum Puasa di Bulan Sya'ban",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum Puasa di Bulan Sya'ban</h1>\n\n<p>‘Aisyah radhiyallahu ‘anha mengatakan,</p>\n\n<p style=\"font-size:18px;text-align:right;\">لَمْ يَكُنِ النَّبِىُّ – صلى الله عليه وسلم – يَصُومُ شَهْرًا أَكْثَرَ مِنْ شَعْبَانَ ، فَإِنَّهُ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ</p>\n\n<p><i>“Nabi shallallahu ‘alaihi wa sallam tidak biasa berpuasa pada satu bulan yang lebih banyak dari bulan Sya’ban. Nabi shallallahu ‘alaihi wa sallam biasa berpuasa pada bulan Sya’ban seluruhnya.”</i> (HR. Bukhari no. 1970 dan Muslim no. 1156).</p>\n\n<p>Dalam lafazh Muslim, ‘Aisyah <i>radhiyallahu ‘anha</i> mengatakan,</p>\n\n<p style=\"font-size:18px;text-align:right;\">كَانَ يَصُومُ شَعْبَانَ كُلَّهُ كَانَ يَصُومُ شَعْبَانَ إِلاَّ قَلِيلاً</p>\n\n<p><i>“Nabi shallallahu ‘alaihi wa sallam biasa berpuasa pada bulan Sya’ban seluruhnya. Namun beliau berpuasa hanya sedikit hari saja.”</i> (HR. Muslim no. 1156)</p>\n\n<p>Yang dimaksud di sini adalah berpuasa pada mayoritas harinya (bukan seluruh harinya) sebagaimana diterangkan oleh Az Zain ibnul Munir. Para ulama berkata bahwa Nabi shallallahu ‘alaihi wa sallam tidak menyempurnakan berpuasa sebulan penuh selain di bulan Ramadhan agar tidak disangka puasa selain Ramadhan adalah wajib.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Niat Puasa Sya'ban",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Sya'ban</h1>\n\n<p>Berikut ini lafal niat puasa Sya‘ban:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ غَدٍ عَنْ أَدَاءِ سُنَّةِ شَعْبَانَ لِلهِ تَعَالَى</p>\n\n<p><i>Nawaitu shauma ghadin ‘an adâ’i sunnati Sya‘bana lillâhi ta‘âlâ.</i></p>\n\n<p>Artinya: “Aku berniat puasa sunah Sya‘ban esok hari karena Allah SWT.”</p>\n\n<p>Orang yang ingin berpuasa Sya‘ban di siang hari tetapi tidak sempat melafalkan niat dan berniat puasa di malam harinya boleh menyusul pelafalan niat dan memansang niat sunah puasa Sya‘ban seketika itu juga. Kewajiban niat di malam hari hanya berlaku untuk puasa wajib. Untuk puasa sunah, niat boleh dilakukan di siang hari sejauh yang bersangkutan belum makan, minum, dan hal-hal lain yang membatalkan puasa sejak subuh.</p>\n\n<p>Berikut ini lafal niat puasa sunah Sya‘ban di siang hari:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ هَذَا اليَوْمِ عَنْ أَدَاءِ سُنَّةِ شَعْبَانَ لِلهِ تَعَالَى</p>\n\n<p><i>Nawaitu shauma hâdzal yaumi ‘an adâ’i sunnati Sya‘bana lillâhi ta‘âlâ.</i></p>\n\n<p>Artinya: “Aku berniat puasa sunah Sya‘ban hari ini karena Allah SWT.”</p>\n\n<p>Puasa di bulan Sya‘ban dianjurkan. Pasalnya, kita dianjurkan berpuasa sunah pada bulan-bulan agung menurut agama sebagai keterangan Syekh Nawawi Banten berikut ini:</p>\n\n<p style=\"font-size:18px;text-align:right;\">والعاشر صوم أيام الأشهر الحرم وهي أربعة المحرم ورجب وذو القعدة وذو الحجة. وأفضل الشهور رمضان ثم المحرم ثم رجب ثم ذو الحجة ثم وذو القعدة ثم شعبان. وظاهر كلامهم أن باقي شهور السنة على حد سواء</p>\n\n<p>Artinya: <i>“Kesepuluh puasa pada bulan-bulan terhormat, yaitu empat bulan: Muharram, Rajab, Dzulqa‘dah, dan Dzulhijjah. Bulan paling utama adalah Ramadhan, kemudian Muharram, lalu Rajab, selanjutnya Dzulhijjah, kemudian Dzulqa‘dah, lalu Sya‘ban. Ucapan mereka dilihat secara zahir mengatakan bahwa pada bulan selain yang disebutkan kesunahannya sama, ” </i>(Lihat Syekh Nawawi Banten, Nihayatuz Zain, [Beirut: Darul Kutub Al-Ilmiyyah, 2002 M/1422 H], cetakan pertama, halaman 192).</p>\n\n<p>Dari keterangan ini dapat disimpulkan bahwa kita dianjurkan berpuasa sunah pada bulan Muharram, Rajab, Dzulqa‘dah, Dzulhijjah, dan Sya‘ban.</p>\n\n</body>\n</html>\n"
        }
      ]
    },
    {
      "id": 128,
      "title": "Puasa Syawal",
      "hukum_puasa_syawal": [
        {
          "id": 111,
          "title": "Hukum Puasa Syawal",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Hukum Puasa Syawal</h1>\n\n<p>Hukum puasa syawal adalah sunnah muakkadah, yakni sunnah yang sangat dianjurkan. Hal ini berdasarkan sabda Rasulullah shallallahu ‘alaihi wasallam:</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ</p>\n\n<p><i>“Barangsiapa berpuasa di bulan Ramadhan, kemudian mengikutinya dengan enam hari di bulan Syawal, maka ia seperti berpuasa setahun”</i> (HR. Muslim)</p>\n\n<p>Sungguh tidak pantas kita menyia-nyiakan puasa ini. Hanya enam hari di bulan Syawal, namun keutamaannya luar biasa.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 112,
          "title": "Waktu Puasa Syawal",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Waktu Puasa Syawal</h1>\n\n<p>Puasa Syawal dilaksanakan selama enam hari di bulan Syawal, mulai tanggal 2 Syawal yakni sehari setelah Idul Fitri. Adapun saat hari raya idul fitri, diharamkan berpuasa.</p>\n\n<p>Puasa enam hari di bulan Syawal ini apakah harus berturut-turut atau tidak? Sayyid Sabiq dalam Fiqih Sunnah menjelaskan bahwa menurut pendapat Imam Ahmad, puasa Syawal boleh dilakukan secara berurutan, boleh pula tidak berurutan. Dan tidaklah yang berurutan lebih utama daripada yang tidak berurutan.</p>\n\n<p>Sedangkan menurut madzhab Syafi’i dan Hanafi, puasa Syawal lebih utama dilaksanakan secara berurutan sejak tanggal 2 Syawal hingga 7 Syawal.</p>\n\n<p>Syaikh Wahbah Az Zuhaili dalam Fiqih Islam wa Adillatuhu mengatakan, puasa enam hari di bulan Syawal ini boleh dikerjakan terpisah-pisah, tapi lebih afdhal berurutan dan langsung setelah hari raya (dikerjakan tanggal 2 – 7 Syawal). Karena hal itu berarti menyegerakan ibadah.</p>\n\n<p>Jadi, tidak ada madzhab yang tidak memperbolehkan puasa ini di hari lain selain tanggal 2 sampai 7. Yang penting masih berada di bulan Syawal.</p>\n\n<p>Namun, hendaknya tidak berpuasa khusus di hari Jum’at tanpa mengiringinya dengan puasa di hari Kamis atau Sabtu karena adanya larangan Rasulullah yang diriwayatkan oleh Ibnu Majah. Para ulama menjelaskan bahwa larangan itu menegaskan makruhnya puasa di hari Jum’at tanpa mengiringinya dengan puasa di hari Kamis atau Sabtu.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 113,
          "title": "Tata Cara Puasa Syawal",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Tata Cara Puasa Syawal</h1>\n\n<p>Tata cara puasa Syawal sama dengan tata cara puasa lainnya secara umum. Yang membedakan hanyalah niatnya.</p>\n\n<p>Jadi secara ringkas, tata cara puasa Syawal sebagai berikut:</p>\n\n<p><b>1. Niat</b></p>\n\n<p>Niat ini boleh dilakukan di malam hari, boleh dilakukan saat makan sahur, bahkan boleh dilakukan ketika pagi karena ini merupakan puasa sunnah.</p>\n\n<p><b>2. Makan sahur</b></p>\n\n<p>Disunnahkan makan sahur sebelum terbit fajar. Namun tidak makan sahur pun (misalnya terlambat bangun) tidak apa-apa, dalam artian puasa tetap sah.</p>\n\n<p><b>3. Menahan diri dari segala hal yang membatalkan puasa</b></p>\n\n<p>Yakni menahan dari makan, minum, berhubungan dan hal-hal yang membatalkan puasa sejak terbit fajar hingga tenggelamnya matahari.</p>\n\n<p><b>4. Berbuka</b></p>\n\n<p>Disunnahkan menyegerakan berbuka puasa ketika matahari terbenam, yakni bersamaan dengan masuknya waktu Maghrib.</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 114,
          "title": "Niat Puasa Syawal",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Niat Puasa Syawal</h1>\n\n<p>Semua ulama sepakat bahwa niat tempatnya di hati. Ia tidak harus dilafadzkan karena melafadzkan niat bukanlah syarat. Menurut madzhab Maliki, yang terbaik adalah tidak melafadzkan niat karena tidak ada contohnya dari Rasulullah shallallahu ‘alaihi wasallam.</p>\n\n<p>Demikian pula Sayyid Sabiq dalam Fiqih Sunnah menjelaskan, niat adalah pekerjaan hati dan tidak ada sangkut pautnya dengan lisan. Seseorang yang makan sahur dengan maksud akan berpuasa syawal, berarti ia telah niat puasa syawal. Bahkan jika ia tidak makan sahur lalu paginya bermaksud berpuasa syawal, itu juga termasuk niat puasa syawal.</p>\n\n<p>Sedangkan Syaikh Wahbah Az Zuhaili menjelaskan, jumhur ulama mensunnahkan melafadzkan niat dalam rangka membantu hati menghadirkan niat.</p>\n\n<p>Bagi yang berpendapat melafadzkan niat, berikut ini lafadz niat puasa syawal beserta tulisan latin artinya:</p>\n\n<p style=\"font-size:18px;text-align:right;\">نَوَيْتُ صَوْمَ غَدٍ عَنْ سِتَّةٍ مِنْ شَوَّالٍ سُنَّةً لِلَّهِ تَعَالَي</p>\n\n<p><i>(Nawaitu shouma ghodin ‘an sittatin min syawwaalinn sunnatan lillaahi ta’aalaa)</i></p>\n\n<p>Artinya: Aku berniat puasa besok dari enam hari Syawal, sunnah karena Allah Ta’ala</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 115,
          "title": "Keutamaan Puasa Syawal",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Keutamaan Puasa Syawal</h1>\n\n<p>Puasa selama enam hari di bulan Syawal ini memiliki keutamaan yang luar biasa. Keutamaan puas Syawal setelah puasa Ramadhan adalah seperti berpuasa setahun penuh.</p>\n\n<p>Rasulullah shallallahu ‘alaihi wasallam menjelaskan dalam beberapa hadits shahih berikut ini:</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ</p>\n\n<p><i>“Barangsiapa berpuasa di bulan Ramadhan, kemudian mengikutinya dengan enam hari di bulan Syawal, maka ia seperti berpuasa setahun”</i> (HR. Muslim)</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ سِتَّةَ أَيَّامٍ بَعْدَ الْفِطْرِ كَانَ تَمَامَ السَّنَةِ</p>\n\n<p><i>“Barangsiapa berpuasa enam hari setelah Idul Fitri, maka dia seperti berpuasa setahun penuh”</i>(HR. Ibnu Majah, shahih)</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ كَانَ كَصَوْمِ الدَّهْرِ</p>\n\n<p><i>“Barang siapa berpuasa Ramadhan, lalu mengikutinya dengan enam hari di bulan Syawal, ia seperti puasa setahun”</i> (HR. Ibnu Majah, shahih)</p>\n\n</body>\n</html>\n"
        },
        {
          "id": 116,
          "title": "Haruskah Qadha puasa Ramadhan dulu?",
          "description": "<!DOCTYPE html>\n<html>\n<head>\n<style>\n\nh1 {\n    font-size: 25px;\n\ttext-align: center;\n}\n\np {\n   text-align: justify;\n}\n\n</style>\n</head>\n<body>\n\n<h1>Haruskah qadha puasa Ramadhan dulu?</h1>\n\n<p>Bagi muslimah, secara umum pasti memiliki udzur saat Ramadhan yang membuatnya tidak boleh berpuasa yakni datangnya haid. Lalu muncul pertanyaan, apakah puasa enam hari di bulan Syawal ini harus menunggu qadha puasa Ramadhan dulu? Apakah boleh puasa syawal dulu agar mendapatkan keutamaannya?</p>\n\n<p>Dalam hal ini ada dua pendapat. Madzab Hanbali berpendapat, tidak boleh berpuasa sunnah sebelum qadha’ puasa Ramadhan. Yang wajib harus didahulukan daripada yang sunnah. Qadha puasa Ramadhan harus diselesaikan baru menjalankan puasa sunnah.</p>\n\n<p>Salah seorang ualam Hambali, Ibnu Rajab menambahkan, meskipun puasa sunnah boleh dilaksanakan sebelum qadha puasa Ramadhan diselesaikan, keutamaan seperti puasa setahun penuh tidak bisa didapatkan. Sebab dalam hadits disebutkan:</p>\n\n<p style=\"font-size:18px;text-align:right;\">مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ</p>\n\n<p><i>“Barangsiapa berpuasa di bulan Ramadhan, kemudian mengikutinya dengan enam hari di bulan Syawal, maka ia seperti berpuasa setahun”</i> (HR. Muslim)</p>\n\n<p>Keutamaan seperti puasa setahun itu untuk orang yang “tsumma atba’ahu” (kemudian mengikutinya) dengan puasa enam hari di bulan Syawal. Sedangkan orang yang belum qadha puasa Ramadhan belum bisa dikatakan telah berpuasa Ramadhan.</p>\n\n<p>Pendapat kedua, jumhur ulama menyatakan boleh puasa sunnah sebelum qadha puasa Ramadhan. Sedangkan mengenai apakah keutamaan puasa Syawal seperti puasa setahun penuh, sebagian ulama berpendapat seseorang bisa mendapatkan keutamaan tersebut meskipun belum selesai qadha puasa Ramadhan.</p>\n\n<p>Di antara hujjahnya, orang yang terhalang beberapa hari puasa Ramadhan karena haid, ia tetap bisa disebut telah berpuasa Ramadhan. Selain itu, puasa Syawal telah ditentukan waktunya yang terbatas di bulan Syawal sedangkan qadha Ramadhan tidak hanya terbatas di bulan Syawal.</p>\n\n<p>Yang paling ideal, dengan mengkompromikan dua pendapat di atas, sebaiknya mengqadha’ puasa Ramadhan terlebih dahulu lalu mengerjakan puasa sunnah di bulan Syawal sehingga keutamaannya pun bisa didapat.</p>\n\n<p>Kalaupun tidak bisa atau waktunya tidak cukup, hendaknya puasa enam hari di bulan Syawal didahulukan baru setelah itu qadha’ Ramadhan. Inilah yang dicontohkan oleh Ummul Mukminin Aisyah radhiyallahu ‘anha. Beliau menuturkan:</p>\n\n<p style=\"font-size:18px;text-align:right;\">كَانَ يَكُونُ عَلَىَّ الصَّوْمُ مِنْ رَمَضَانَ ، فَمَا أَسْتَطِيعُ أَنْ أَقْضِىَ إِلاَّ فِى شَعْبَانَ . قَالَ يَحْيَى الشُّغْلُ مِنَ النَّبِىِّ أَوْ بِالنَّبِىِّ صلى الله عليه وسلم</p>\n\n<p><i>Aku punya hutang puasa Ramadhan, aku tak dapat mengqadhanya kecuali di bulan Sya’ban, karena sibuk melayani Nabi shallallahu ‘alaihi wasallam</i> (HR. Al Bukhari)</p>\n\n</body>\n</html>\n"
        }
      ]
    }
  ]
}